Revit 2027 API
ElectricalSystem.Frame Property
 The Frame value of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Frame { get; set; }
Public Property Frame As Double
	Get
	Set
public:
property double Frame {
	double get ();
	void set (double value);
}
member Frame : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for frame is not a number -or- When setting this property: The given value for frame is not finite
ArgumentOutOfRangeException |  When setting this property: The given value for frame must be non-negative.
InvalidOperationException |  This property only available when System Type is Power and Circuit Type is NOT Space!
Remarks
 This property is used to retrieve the Frame value of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace